src/cf/Documents/GDS_ДоставкаГСМ_РаспределениеДоходовПоТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_ДоставкаГСМ_РаспределениеДоходовПоТС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МеКаМи_КВыгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширеннаяИнформацияОЛокации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.GDS_ПУ_Расширенный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_ПоПЛ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПЛ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Грузоотправитель или грузополучатель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУслуг</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщийУчасток</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширеннаяИнформацияОЛокации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.GDS_ПУ_Расширенный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/GDS_ДоставкаГСМ_РаспределениеДоходовПоТС/Ext/ManagerModule.bsl
Процедура ДоставкаГСМ(ТабДок, МассивОбъектов) Экспорт

	ТабДок.Очистить();
    ТабДок.ИмяПараметровПечати = "ПФ_ДоставкаГСМ";
    ТабДок.АвтоМасштаб = Истина;
	
	Макет = Документы.GDS_ДоставкаГСМ_РаспределениеДоходовПоТС.ПолучитьМакет("ДоставкаЗаДТ");

	ВставлятьРазделительСтраниц = Ложь;
	Для Каждого Документ Из МассивОбъектов Цикл	
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
		
		ОбластьШапкаТаблицы2 = Макет.ПолучитьОбласть("Шапка2");
		ОбластьПодвалТаблицы2 = Макет.ПолучитьОбласть("Подвал2");
		ОбластьДетальныхЗаписей2 = Макет.ПолучитьОбласть("Детали2");
		
		ОбластьЗаголовок.параметры.Нач = Формат(НачалоМесяца(Документ.Дата),"ДФ=dd.MM.yyyy");            
		ОбластьЗаголовок.параметры.Кон = Формат(КонецМесяца(Документ.Дата),"ДФ=dd.MM.yyyy");
		
		ТабДок.Вывести(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьШапкаТаблицы);
		
		ТЗ = Документ.ТЧ.Выгрузить();
		ТЗ.Свернуть("Заказчик,ПУ,МеКаМи_РасширеннаяИнформацияОЛокации","Сумма,Количество");
		
		пп = 0;
		Для Каждого Строка из ТЗ Цикл
			Цена = 0;
			ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
			КолСтр = Строка.МеКаМи_РасширеннаяИнформацияОЛокации.ДетальнаяИнформацияПоПериодам.Количество();

			пп = пп + 1;
			Пока КолСтр<>0 Цикл
				ТекСтр = Строка.МеКаМи_РасширеннаяИнформацияОЛокации.ДетальнаяИнформацияПоПериодам[КолСтр-1];
			    Если КонецМесяца(Документ.Дата) >= ТекСтр.Период Тогда
					ОбластьДетальныхЗаписей.Параметры.Заполнить(ТекСтр);
					Цена = ТекСтр.ЦенаЗаТоннуСУчетомЛогистики;
				КонецЕсли;
				КолСтр = КолСтр - 1;
			КонецЦикла;
			ОбластьДетальныхЗаписей.Параметры.ПунктОтправления = Строка.МеКаМи_РасширеннаяИнформацияОЛокации.ПунктОтправления;
			ОбластьДетальныхЗаписей.Параметры.ПунктПрибытия    = Строка.МеКаМи_РасширеннаяИнформацияОЛокации.ПунктПрибытия;
			ОбластьДетальныхЗаписей.Параметры.ПП               = пп;
			ТабДок.Вывести(ОбластьДетальныхЗаписей);
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьПодвалТаблицы);
		ТабДок.Вывести(ОбластьПодвал);
		
		ТабДок.Вывести(ОбластьШапкаТаблицы2);
		пп = 0;
		Литров = 0;
		Сумма = 0;
		
		
		ТЗ = Документ.ТЧ_ПоПЛ.Выгрузить();
		ТЗ.Колонки.Добавить("Расценка");
		ТЗ.Свернуть("Контрагент,ПУ,Заказчик,Подразделение,Маршрут,МеКаМи_РасширеннаяИнформацияОЛокации,Расценка","Количество, Сумма");
		
		Для Каждого Строка из ТЗ Цикл
			Если Строка.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;                      
			Цена = Строка.Сумма / Строка.Количество;
			Если Цена = 0 Тогда
				Продолжить;
			КонецЕсли;                      
			
			пп = пп + 1;
			ЗаполнитьЗначенияСвойств(ОбластьДетальныхЗаписей2.Параметры,Строка);
			ОбластьДетальныхЗаписей2.Параметры.ПунктОтправления = Строка.МеКаМи_РасширеннаяИнформацияОЛокации.ПунктОтправления;
			ОбластьДетальныхЗаписей2.Параметры.ПунктПрибытия    = Строка.МеКаМи_РасширеннаяИнформацияОЛокации.ПунктПрибытия;
			ОбластьДетальныхЗаписей2.Параметры.Литры            = Строка.Количество;
			Литров = Литров +  Строка.Количество;
			ОбластьДетальныхЗаписей2.Параметры.Сумма            = Строка.Сумма;
			ОбластьДетальныхЗаписей2.Параметры.Цена             = цена;
			ОбластьДетальныхЗаписей2.Параметры.ПП               = пп;
			Сумма = Сумма + Строка.Сумма;
			ТабДок.Вывести(ОбластьДетальныхЗаписей2);
		КонецЦикла;
		
		
		ОбластьПодвалТаблицы2.Параметры.Литры      = Литров;
		ОбластьПодвалТаблицы2.Параметры.Сумма      = Сумма;
		ОбластьПодвалТаблицы2.Параметры.СуммаНДС   = Сумма * 0.22;
		ОбластьПодвалТаблицы2.Параметры.СуммаВсего = Сумма + Сумма * 0.22;
		
		ТабДок.Вывести(ОбластьПодвалТаблицы2);
		
		
		
		ВставлятьРазделительСтраниц = Истина;
	
	КонецЦикла;

КонецПроцедуры
